content/about.md
+++
title = "About"
date = 2025-08-19T21:35:00+08:00
draft = false
+++

4chan user, old school player, child educator and a man doing hacker.
Studying Master program in Cyberspace Security from [Jinan University](https://en.wikipedia.org/wiki/Jinan_University).
Proud of my jack of all trades, surely master of none but still proud.


## Professional Skill {#professional-skill}

-   _Maybe make things with AI_ category
    -   Programming: Python, javascript
    -   Software: Emacs, Latex
-   _"Skill issue"_ category
    -   Programming: C, C++, bash, Lisp
    -   Software: Docker, Git
-   _Learn X in Y minutes_ category
    -   Programming: Java, Go, Rust
    -   Framework: React

Other techs I've learned:

-   GNU/Linux Distro, install and usage.
    **InstallGentoo** for 3 times and do LFS walkthrough one time.
    Also has experience with FreeBSD and Hackintosh, etc.
    Obsessed with notebook _All in One_ in my college life.
-   Vim and Emacs, the God of Editor and the Editor of God.
    I use them for writing org mode, also this blog.
-   PL Theory and Proof Assistant. AKA Lean4.
-   Music Production.
-   Private Tracker.


## Hobbyist {#hobbyist}

-   Language
    -   **Mandarin** (Native Speaker);
        Output Simplified Chinese, Can read Traditional Chinese fluently;
        **Cantonese** (Just for fun).
    -   **English** (B2+ by passing [CET-6](https://en.wikipedia.org/wiki/College_English_Test) with 570 point), also watch English TV operas.
    -   **Japanese** (~~B2 by passing [JLPT N1](https://en.wikipedia.org/wiki/Japanese-Language_Proficiency_Test)~~ B1 by N1 89 points which still failed :-( )
    -   Learning French, Korean and Russian, still at alphabet. Seriously it takes time and effort.
-   Another major course
    -   **Medical**: anatomy
    -   **Law**: legal theory

<!--listend-->

-   Entertainment


## Battlestation Now {#battlestation-now}

-   **Dell G15** with RTX 3060 Laptop, **Windows 10 IoT LTSC**.
    Connected with 27-inch **4K monitor**, KEMOVE K61 **mechanical keyboard**,
    and **XBox Controller** for gaming.

    Still a desktop is preferred, so that my 16TB HDD can directly put in.
    (2025.8.20)
